mugen-x86/logs/fio/oe_test_fio_002/2023-06-07-18:13:04.log
+ source ./common/disk_lib.sh
++ source /root/mugen/libs/locallibs/common_lib.sh
+++ python3 --version
+++ '[' 0 -eq 0 ']'
+++ source /root/mugen/libs/locallibs/common_lib_python.sh
+ main
++ type -t post_test
+ '[' -n function ']'
+ trap post_test EXIT INT HUP TERM
+ rpm -qa
+ grep expect
++ type -t config_params
+ '[' -n '' ']'
++ type -t pre_test
+ '[' -n function ']'
+ pre_test
+ LOG_INFO 'Start to prepare the test environment!'
+ message='Start to prepare the test environment!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start to prepare the test environment!'
Wed Jun  7 18:13:14 2023 - INFO  - Start to prepare the test environment!
+ check_free_disk
++ TEST_DISK
++ id=1
++ python3 /root/mugen/libs/locallibs/get_test_device.py --device disk --node 1
+ disks=sr0
+ disk_list=($disks)
+ local_disk=sr0
+ local_disk1=
+ local_disk2=
+ local_disk3=
+ DNF_INSTALL fio
+ pkgs=fio
+ node=1
+ '[' -z '' ']'
+ tmpfile=
++ python3 /root/mugen/libs/locallibs/rpm_manage.py install --pkgs fio --node 1 --tempfile ''
+ tmpfile2=/tmp/tmp3qrro7or
+ '[' -z '' ']'
+ tmpfile=/tmp/tmp3qrro7or
+ test -f test.txt
+ touch test.txt
+ LOG_INFO 'End to prepare the test environment!'
+ message='End to prepare the test environment!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'End to prepare the test environment!'
Wed Jun  7 18:15:06 2023 - INFO  - End to prepare the test environment!
++ type -t run_test
+ '[' -n function ']'
+ run_test
+ LOG_INFO 'Start executing testcase!'
+ message='Start executing testcase!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start executing testcase!'
Wed Jun  7 18:15:07 2023 - INFO  - Start executing testcase!
+ fio-dedupe -o 1 /dev/sr0
+ grep 'items processed'
open: No medium found
+ CHECK_RESULT 1 0 0 'fio-dedupe -o option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -o option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio-dedupe -o option failed'
+ LOG_ERROR 'fio-dedupe -o option failed'
+ message='fio-dedupe -o option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio-dedupe -o option failed'
Wed Jun  7 18:15:09 2023 - ERROR - fio-dedupe -o option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 31'
+ message='oe_test_fio_002.sh line 31'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 31'
Wed Jun  7 18:15:10 2023 - ERROR - oe_test_fio_002.sh line 31
+ '[' 0 -eq 1 ']'
+ return 0
+ fio-dedupe -c 1 /dev/
+ grep 'items processed'
+ CHECK_RESULT 1 0 0 'fio-dedupe -c option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -c option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio-dedupe -c option failed'
+ LOG_ERROR 'fio-dedupe -c option failed'
+ message='fio-dedupe -c option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio-dedupe -c option failed'
Wed Jun  7 18:15:12 2023 - ERROR - fio-dedupe -c option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 33'
+ message='oe_test_fio_002.sh line 33'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 33'
Wed Jun  7 18:15:13 2023 - ERROR - oe_test_fio_002.sh line 33
+ '[' 0 -eq 1 ']'
+ return 0
+ fio-dedupe -B 1 /dev/
+ CHECK_RESULT 1 0 0 'fio-dedupe -B option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -B option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio-dedupe -B option failed'
+ LOG_ERROR 'fio-dedupe -B option failed'
+ message='fio-dedupe -B option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio-dedupe -B option failed'
Wed Jun  7 18:15:15 2023 - ERROR - fio-dedupe -B option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 35'
+ message='oe_test_fio_002.sh line 35'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 35'
Wed Jun  7 18:15:16 2023 - ERROR - oe_test_fio_002.sh line 35
+ '[' 0 -eq 1 ']'
+ return 0
+ fio-dedupe -p 1 /dev/
+ CHECK_RESULT 1 0 0 'fio-dedupe -p option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -p option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio-dedupe -p option failed'
+ LOG_ERROR 'fio-dedupe -p option failed'
+ message='fio-dedupe -p option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio-dedupe -p option failed'
Wed Jun  7 18:15:18 2023 - ERROR - fio-dedupe -p option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 37'
+ message='oe_test_fio_002.sh line 37'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 37'
Wed Jun  7 18:15:19 2023 - ERROR - oe_test_fio_002.sh line 37
+ '[' 0 -eq 1 ']'
+ return 0
+ fio --filename=test_file --direct=1 --rw=randwrite --numjobs=1 --iodepth=16 --ioengine=libaio --bs=4k --group_reporting --name=zhangyi --log_avg_msec=500 --write_bw_log=test-fio --size=1G
zhangyi: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.32
Starting 1 process
zhangyi: Laying out IO file (1 file / 1024MiB)

zhangyi: (groupid=0, jobs=1): err= 0: pid=2450: Wed Jun  7 18:19:53 2023
  write: IOPS=957, BW=3829KiB/s (3921kB/s)(1024MiB/273857msec); 0 zone resets
    slat (usec): min=98, max=26400, avg=577.22, stdev=548.14
    clat (usec): min=933, max=411794, avg=15938.38, stdev=12356.85
     lat (usec): min=1706, max=412338, avg=16515.60, stdev=12401.40
    clat percentiles (msec):
     |  1.00th=[    8],  5.00th=[   11], 10.00th=[   12], 20.00th=[   13],
     | 30.00th=[   14], 40.00th=[   15], 50.00th=[   16], 60.00th=[   16],
     | 70.00th=[   17], 80.00th=[   18], 90.00th=[   20], 95.00th=[   22],
     | 99.00th=[   32], 99.50th=[   41], 99.90th=[  300], 99.95th=[  317],
     | 99.99th=[  393]
   bw (  KiB/s): min=  894, max= 5584, per=100.00%, avg=3831.52, stdev=668.84, samples=545
   iops        : min=  225, max= 1396, avg=957.64, stdev=167.17, samples=545
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.05%, 10=4.20%, 20=86.65%, 50=8.82%
  lat (msec)   : 100=0.12%, 250=0.01%, 500=0.14%
  cpu          : usr=2.15%, sys=69.94%, ctx=217817, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,262144,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=3829KiB/s (3921kB/s), 3829KiB/s-3829KiB/s (3921kB/s-3921kB/s), io=1024MiB (1074MB), run=273857-273857msec

Disk stats (read/write):
  vda: ios=9/262680, merge=0/26577, ticks=29/307961, in_queue=324255, util=97.23%
+ CHECK_RESULT 0 0 0 'fio --filename=test_file option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio --filename=test_file option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/sr0 -direct=1 -iodepth 1 -thread -rw=read -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep sr0
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
+ CHECK_RESULT 1 0 0 'fio -filename=/dev option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio -filename=/dev option failed'
+ LOG_ERROR 'fio -filename=/dev option failed'
+ message='fio -filename=/dev option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio -filename=/dev option failed'
Wed Jun  7 18:19:58 2023 - ERROR - fio -filename=/dev option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 41'
+ message='oe_test_fio_002.sh line 41'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 41'
Wed Jun  7 18:19:59 2023 - ERROR - oe_test_fio_002.sh line 41
+ '[' 0 -eq 1 ']'
+ return 0
+ fio -filename=/dev/sr0 -direct=1 -iodepth 1 -thread -rw=write -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep sr0
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
+ CHECK_RESULT 1 0 0 'fio -filename=/dev option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio -filename=/dev option failed'
+ LOG_ERROR 'fio -filename=/dev option failed'
+ message='fio -filename=/dev option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio -filename=/dev option failed'
Wed Jun  7 18:20:04 2023 - ERROR - fio -filename=/dev option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 43'
+ message='oe_test_fio_002.sh line 43'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 43'
Wed Jun  7 18:20:05 2023 - ERROR - oe_test_fio_002.sh line 43
+ '[' 0 -eq 1 ']'
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=randread -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
mytest: (g=0): rw=randread, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.32
Starting 30 threads
mytest: Laying out IO file (1 file / 204800MiB)
fio: ENOSPC on laying out file, stopping
fio: pid=0, err=28/file:filesetup.c:240, func=write, error=No space left on device
fio: looks like your file system does not support direct=1/buffered=0
fio: destination does not support O_DIRECT
fio: looks like your file system does not support direct=1/buffered=0
fio: destination does not support O_DIRECT
fio: pid=2488, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: pid=2503, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: looks like your file system does not support direct=1/buffered=0
fio: destination does not support O_DIRECT
fio: pid=2515, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: looks like your file system does not support direct=1/buffered=0
fio: destination does not support O_DIRECT
fio: pid=2492, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: looks like your file system does not support direct=1/buffered=0
fio: destination does not support O_DIRECT
fio: pid=2499, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: looks like your file system does not support direct=1/buffered=0
fio: looks like your file system does not support direct=1/buffered=0
fio: destination does not support O_DIRECT
fio: pid=2506, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: looks like your file system does not support direct=1/buffered=0
fio: destination does not support O_DIRECT
fio: looks like your file system does not support direct=1/buffered=0
fio: pid=2500, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: destination does not support O_DIRECT
fio: looks like your file system does not support direct=1/buffered=0
fio: destination does not support O_DIRECT
fio: pid=2490, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: looks like your file system does not support direct=1/buffered=0
fio: pid=2514, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: looks like your file system does not support direct=1/buffered=0
fio: destination does not support O_DIRECT
fio: looks like your file system does not support direct=1/buffered=0
fio: pid=2489, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: destination does not support O_DIRECT
fio: looks like your file system does not support direct=1/buffered=0
fio: pid=2502, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: destination does not support O_DIRECT
fio: looks like your file system does not support direct=1/buffered=0
fio: pid=2505, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: destination does not support O_DIRECT
fio: destination does not support O_DIRECT
fio: pid=2510, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: pid=2504, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: looks like your file system does not support direct=1/buffered=0
fio: destination does not support O_DIRECT
fio: pid=2496, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: looks like your file system does not support direct=1/buffered=0
fio: destination does not support O_DIRECT
fio: pid=2501, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: destination does not support O_DIRECT
fio: looks like your file system does not support direct=1/buffered=0
fio: destination does not support O_DIRECT
fio: pid=2507, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: pid=2498, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: looks like your file system does not support direct=1/buffered=0
fio: destination does not support O_DIRECT
fio: pid=2511, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: looks like your file system does not support direct=1/buffered=0
fio: destination does not support O_DIRECT
fio: pid=2509, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: looks like your file system does not support direct=1/buffered=0
fio: destination does not support O_DIRECT
fio: pid=2493, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: looks like your file system does not support direct=1/buffered=0
fio: destination does not support O_DIRECT
fio: pid=2495, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: looks like your file system does not support direct=1/buffered=0
fio: destination does not support O_DIRECT
fio: pid=2513, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: looks like your file system does not support direct=1/buffered=0
fio: destination does not support O_DIRECT
fio: pid=2494, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: looks like your file system does not support direct=1/buffered=0
fio: destination does not support O_DIRECT
fio: pid=2497, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: looks like your file system does not support direct=1/buffered=0
fio: destination does not support O_DIRECT
fio: pid=2491, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: looks like your file system does not support direct=1/buffered=0
fio: destination does not support O_DIRECT
fio: pid=2512, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: looks like your file system does not support direct=1/buffered=0
fio: destination does not support O_DIRECT
fio: pid=2508, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument
fio: looks like your file system does not support direct=1/buffered=0
fio: destination does not support O_DIRECT
fio: pid=2516, err=22/file:filesetup.c:805, func=open(/dev/vdb), error=Invalid argument


Run status group 0 (all jobs):
+ CHECK_RESULT 30 0 0 'fio -filename=/dev option failed'
+ actual_result=30
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 30 ']'
+ '[' 0 -eq 0 ']'
+ test 30x '!=' 0x
+ test -n 'fio -filename=/dev option failed'
+ LOG_ERROR 'fio -filename=/dev option failed'
+ message='fio -filename=/dev option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio -filename=/dev option failed'
Wed Jun  7 18:20:08 2023 - ERROR - fio -filename=/dev option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 45'
+ message='oe_test_fio_002.sh line 45'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 45'
Wed Jun  7 18:20:10 2023 - ERROR - oe_test_fio_002.sh line 45
+ '[' 0 -eq 1 ']'
+ return 0
+ fio -filename=/dev/sr0 -direct=1 -iodepth 1 -thread -rw=randwrite -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep sr0
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
+ CHECK_RESULT 1 0 0 'fio -filename=/dev option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio -filename=/dev option failed'
+ LOG_ERROR 'fio -filename=/dev option failed'
+ message='fio -filename=/dev option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio -filename=/dev option failed'
Wed Jun  7 18:20:14 2023 - ERROR - fio -filename=/dev option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 47'
+ message='oe_test_fio_002.sh line 47'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 47'
Wed Jun  7 18:20:16 2023 - ERROR - oe_test_fio_002.sh line 47
+ '[' 0 -eq 1 ']'
+ return 0
+ fio -filename=/dev/sr0 -direct=1 -iodepth 1 -thread -rw=read -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest --output test.txt
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:805, func=open(/dev/sr0), error=No medium found
+ test -f test.txt
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ genfio -d /dev/sr0,/dev/,/dev/ -a -b 4k,128k,1m -r 100 -a -x dellr720-day2/
/usr/bin/genfio: line 280: hostname: command not found
Generating dellr720-day2/-4k,128k,1m-all-write,randwrite,read,randread-sr0,dev,dev.fio
Estimated Time = 4800 seconds : 1 hour 20 minutes
+ test -d dellr720-day2
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ genfio -h
+ grep -i usage
usage of genfio:
+ CHECK_RESULT 0 0 0 'genfio -h option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='genfio -h option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ LOG_INFO 'End of testcase execution!'
+ message='End of testcase execution!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'End of testcase execution!'
Wed Jun  7 18:20:50 2023 - INFO  - End of testcase execution!
+ CASE_RESULT 0
+ case_re=0
+ test -z 8
+ test 8 -gt 0
+ LOG_ERROR 'failed to execute the case.'
+ message='failed to execute the case.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'failed to execute the case.'
Wed Jun  7 18:20:52 2023 - ERROR - failed to execute the case.
+ exit 8
+ post_test
+ LOG_INFO 'Start environment cleanup.'
+ message='Start environment cleanup.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start environment cleanup.'
Wed Jun  7 18:20:53 2023 - INFO  - Start environment cleanup.
+ rm -rf test-fio_bw.1.log test.txt test_file dellr720-day2
+ DNF_REMOVE
+ node=1
+ pkg_list=
+ mode=0
+ [[ -z /tmp/tmp3qrro7or ]]
+ '[' 0 -ne 0 ']'
+ '[' 1 == 0 ']'
+ python3 /root/mugen/libs/locallibs/rpm_manage.py remove --node 1 --pkgs '' --tempfile /tmp/tmp3qrro7or
+ '[' 0 -ne 0 ']'
+ LOG_INFO 'Finish environment cleanup.'
+ message='Finish environment cleanup.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Finish environment cleanup.'
Wed Jun  7 18:21:39 2023 - INFO  - Finish environment cleanup.